app/controllers/assessor_controller.rb

SELECT "scenarios".* FROM "scenarios" WHERE "scenarios"."zomato_restaurant_id" IN (16953545, 16947626, 16949500, 16949899, 16958267, 16952379, 16941602, 18289813, 16953327, 16952164, 16940012, 16941663, 16946181, 17830132, 16952532, 16951213, 16946331, 16940446, 17949781)
---
  def home
    @nearby_restaurants = Scenario.where(zomato_restaurant_id: eval(@scenario.nearby_restaurants))

SELECT "reviews"."id" FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", "16944525"]]
SELECT "entities".* FROM "entities" WHERE ("entities"."property" != ?) AND "entities"."review_id" IN (1, 2, 3, 4, 5)  [["property", ""]]
---
  def sample
    # response = RestClient.post 'https://api.textrazor.com', {'extractors' => 'entities,words,relations,senses', 'text' => "This place isn't good. Very small spread populated by underwhelming dishes. The naan was dry and thin--perhaps it had been hanging out with some local tortillas and picked up some bad habbits. The saag paneer was mediocre and the tandoori chicken was dry as a bone. All the dishes were run of the mill. Now for the interesting part! Somebody elses dishes and glass (complete with a straw that neither I or my companion never use) magically appeared on our table between trips to the buffet. I subsequently lost my appetite upon discovering an extra fork and realizing I may have not used my own! My partner's jacket was still at the table so we know we weren't sitting at the wrong table. Management was nice enough to replace my silverware and drink, but given the subpar food and my experience, I'll never go back."}, {'x-textrazor-key' => '0d6ca499a870c7b9e3b81b4933d8634a4c849fd01b41bfaee29f0b4f'}
    # response = JSON.parse response

    # res_id = eval(Scenario.where(primary: true).last.nearby_restaurants)
    # nearby_restaurants = Scenario.select('zomato_user_rating').where(zomato_restaurant_id: res_id).all
    # @ratings = {
    #               Not_Rated: 0,
    #               Poor: 0,
    #               Average: 0,
    #               Good: 0,
    #               Awesome: 0,
    #             }
    # nearby_restaurants.each do |rest|
    #   case rest.zomato_user_rating
    #     when 0
    #       @ratings[:Not_Rated] += 1
    #     when 0.1..2
    #       @ratings[:Poor] += 1
    #     when 2.1..3
    #       @ratings[:Average] += 1
    #     when 3.1..4
    #       @ratings[:Good] += 1
    #     when 4.1..5
    #       @ratings[:Awesome] += 1
    #   end
    # end

    @reviews = Review.select('id').where(restaurant_id: 16948344).all.as_json
    arr = []
    @reviews.each do |item| arr.push item['id'] end
    @reviews = arr
    @entities = Entity.where.not(property: '').where(review_id: @reviews).all

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."primary" = ?  ORDER BY "scenarios"."id" DESC LIMIT 1  [["primary", "t"]]
SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", 20]]
---
    def set_scenario
      id = params[:id].nil? ? Scenario.where(primary: true).last.id : params[:id]
      @scenario = Scenario.find(id)