app/controllers/scenarios_controller.rb

SELECT "scenarios".* FROM "scenarios" WHERE "scenarios"."primary" = ?  [["primary", "t"]]
---
  def index
    @scenarios = Scenario.where(primary: true)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", "16944525"]]
---
  def show
    @reviews = Review.where(restaurant_id: @scenario.zomato_restaurant_id)

INSERT INTO "scenarios" ("business_name", "email", "location_lat", "location_lng", "zomato_postal_code", "zomato_restaurant_id", "zomato_address", "zomato_cuisines", "zomato_has_online_delivery", "zomato_user_rating", "zomato_rating_text", "zomato_rating_color", "zomato_votes_count", "zomato_price_range", "zomato_average_cost_for_two", "zomato_thumb", "zomato_loc_city_id", "zomato_loc_city", "primary", "fips_block_type", "fips_state", "fips_county", "fips_tract", "nearest_zip", "nearest_zip_coords", "closer_zips", "closer_zips_coords", "nearby_restaurants", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @scenario = Scenario.new(scenario_params)

    respond_to do |format|
      if @scenario.save

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", 20]]
---
    def set_scenario
      @scenario = Scenario.find(params[:id])